#Задание 1 Определение выходных
print ("\n Задача 1")
day = int (input("Введите номер дня недели от 1 до 7 "))
if day > 5:
    print ("Это выходной день")  
else:
    print ("Это будний день")  

#Задача 2 Проверки истинности утверждения
print ("\n Задача 2")
print ("Проверка истинности выражения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z")
for X in True,False:
    for Y in True,False:
        for Z in True,False:
            if not (X or Y or Z) == (not X and not Y and not Z):
                print(f"для значений X={X} Y={Y} Z={Z} выражение истинно") 
            else:
               print(f"для значений X={X} Y={Y} Z={Z} выражение ложно") 

#Задача 3 Определение четверти плоскости по координатам Х Y
print ("\n Задача 3")
X = int(input ("Введите координату X "))
Y = int(input ("Введите координату Y "))
if X>0:
    if Y>0:
        print (f"точка с координатами ({X},{Y}) принадлежит I четверти")
    elif Y<0:
        print (f"точка с координатами ({X},{Y}) принадлежит IV четверти")
elif X<0:
    if Y>0:
        print (f"точка с координатами ({X},{Y}) принадлежит II четверти")
    elif Y<0:
        print (f"точка с координатами ({X},{Y}) принадлежит III четверти")

#Задание 4 Вывод диапазона координат точек по четверти
print ("\n Задача 4")
XY = int(input('Введите четверть координатной плоскости от 1 до 4  '))
if XY == 1:
    print ("Диапазон координаты точки по оси абсцисс и оси ординат от 0 до ∞")
elif XY ==2:
    print ("Диапазон координаты точки по оси абсцисс от -∞ до 0, по оси ординат от 0 до ∞")
elif XY ==3:
    print ("Диапазон координаты точки по оси абсцисс и оси ординат от -∞ до 0")
else:
    print ("Диапазон координаты точки по оси абсцисс от 0 до ∞, по оси ординат от -∞ до 0")
#Задание 5 Определение расстояния между двумя точками
import math
X1 = int(input('Введите координату X первой точки '))
Y1 = int(input('Введите координату Y первой точки '))
X2 = int(input('Введите координату X второй точки '))
Y2 = int(input('Введите координату Y второй точки '))
print (f'Длина вектора с введенными координатами  {round(math.sqrt((X1-X2)**2+(Y1-Y2)**2),2)}')